[
    {"tag": "html", "description": "HTML 문서의 전체 구조를 정의하는 루트 요소입니다. 이 태그는 문서의 시작과 끝을 나타내며, 모든 다른 HTML 요소는 이 안에 포함됩니다."},
    {"tag": "head", "description": "웹 문서의 메타데이터, 스크립트, 스타일시트 등을 포함하는 부분입니다. 이 구역은 일반적으로 직접적인 시각적 내용을 포함하지 않습니다."},
    {"tag": "title", "description": "웹 브라우저의 타이틀 바나 페이지 탭에 표시되는 문서의 제목을 정의합니다. SEO 및 사용자 경험에 중요한 요소입니다."},
    {"tag": "body", "description": "웹 페이지의 모든 시각적 내용을 포함하는 주요 부분입니다. 텍스트, 이미지, 비디오 등 사용자에게 보여지는 모든 콘텐츠가 이 안에 위치합니다."},
    {"tag": "header", "description": "웹 페이지의 머리말 부분을 정의하며, 로고, 제목, 탐색 메뉴 등의 요소를 포함할 수 있습니다. 페이지나 섹션의 소개 정보를 담는 용도로 사용됩니다."},
    {"tag": "footer", "description": "웹 페이지나 문서 섹션의 바닥글을 정의합니다. 저작권 정보, 연락처 정보, 사이트 맵 링크 등의 정보를 포함할 수 있습니다."},
    {"tag": "nav", "description": "탐색 링크의 집합을 정의합니다. 주로 메인 메뉴, 목차, 색인 등을 마크업하는 데 사용되며, 사용자가 사이트 내에서 쉽게 이동할 수 있도록 돕습니다."},
    {"tag": "section", "description": "웹 문서나 애플리케이션 내에서 일반적인 섹션을 정의합니다. 독립적으로 배포하거나 재사용할 수 있는 콘텐츠 영역을 그룹화하는 데 사용됩니다."},
    {"tag": "article", "description": "독립적으로 구분되거나 재사용 가능한 구획을 나타냅니다. 뉴스 기사, 블로그 포스트, 사용자 댓글 등의 콘텐츠를 마크업하는 데 적합합니다."},
    {"tag": "aside", "description": "본문 내용과 간접적으로만 관련된 부분을 정의합니다. 사이드바, 광고, 네비게이션 링크 등을 포함하는 데 사용됩니다."},
    {"tag": "h1-h6", "description": "6단계의 제목 레벨을 제공합니다. h1은 가장 높은 레벨의 제목을 나타내며, h6까지 중요도가 점차 감소합니다. 문서의 구조를 명확하게 하는 데 중요한 역할을 합니다."},
    {"tag": "p", "description": "텍스트 단락을 정의합니다. 웹 문서에서 텍스트 콘텐츠를 조직화하는 기본적인 단위로 사용됩니다."},
    {"tag": "br", "description": "텍스트 내에서 강제 줄바꿈을 생성합니다. 주로 시나 주소와 같이 형식을 유지해야 하는 콘텐츠에서 사용됩니다."},
    {"tag": "hr", "description": "주제의 분리나 전환을 나타내기 위해 문서 내에서 수평선을 생성합니다. 섹션 간의 시각적 구분을 제공하는 데 사용됩니다."},
    {"tag": "ol", "description": "순서가 지정된 목록을 생성합니다. 각 목록 항목은 자동으로 번호가 매겨지며, 목록의 순서가 중요한 정보를 전달하는 데 유용합니다."},
    {"tag": "ul", "description": "순서가 지정되지 않은 목록을 생성합니다. 목록 항목은 불릿으로 표시되며, 항목의 순서가 정보 전달에 중요하지 않을 때 사용됩니다."},
    {"tag": "li", "description": "목록(`ol` 또는 `ul`) 내의 개별 항목을 정의합니다. 정보를 점목식으로 나열할 때 사용됩니다."},
    {"tag": "div", "description": "콘텐츠를 그룹화하거나 레이아웃 목적으로 사용되는 범용 컨테이너입니다. CSS와 함께 사용하여 시각적 스타일링을 적용할 수 있습니다."},
    {"tag": "span", "description": "텍스트나 인라인 요소를 그룹화하는 데 사용되는 인라인 컨테이너입니다. 주로 스타일링이나 스크립트 목적으로 사용됩니다."},
    {"tag": "img", "description": "문서에 이미지를 삽입합니다. `src` 속성을 사용하여 이미지의 위치를 지정하며, `alt` 속성을 통해 이미지 설명을 제공할 수 있습니다."},
    {"tag": "a", "description": "다른 페이지, 파일, 위치, 이메일 주소 또는 다른 URL로의 링크를 생성합니다. `href` 속성을 사용하여 링크의 목적지를 지정합니다."},
    {"tag": "link", "description": "문서와 외부 리소스(예: CSS 파일)를 연결합니다. 주로 HTML 문서의 `<head>` 부분에 위치하여 스타일시트를 링크하는 데 사용됩니다."},
    {"tag": "meta", "description": "문서에 대한 메타데이터를 제공합니다. 문자 집합, 페이지 설명, 키워드, 저자 등의 정보를 포함할 수 있으며, 검색 엔진 최적화(SEO)에 중요합니다."},
    {"tag": "style", "description": "HTML 문서 내에 직접 CSS 스타일을 작성할 수 있게 합니다. 일반적으로 `<head>` 요소 안에 위치하며, 문서의 시각적 표현을 정의하는 데 사용됩니다."},
    {"tag": "script", "description": "문서에 JavaScript 코드를 포함하거나 외부 JavaScript 파일을 참조합니다. 동적인 상호작용이나 데이터 처리 등 클라이언트 사이드 스크립트를 구현하는 데 사용됩니다."},
    {"tag": "noscript", "description": "브라우저에서 스크립트 실행이 비활성화되어 있을 경우에만 콘텐츠를 표시합니다. 스크립트를 지원하지 않는 사용자를 위한 대체 콘텐츠를 제공하는 데 사용됩니다."},
    {"tag": "template", "description": "콘텐츠의 일부를 템플릿으로 정의하여, JavaScript를 사용해 동적으로 복제하고 DOM에 추가할 수 있습니다. 재사용 가능한 마크업 구조를 만드는 데 유용합니다."},
    {"tag": "iframe", "description": "현재 문서 내에 다른 HTML 문서를 내장할 수 있는 프레임을 정의합니다. 웹 페이지 내에 다른 페이지를 표시하는 데 사용됩니다."},
    {"tag": "canvas", "description": "JavaScript를 사용하여 그리기 위한 영역을 제공합니다. 그래픽, 게임 그래픽, 데이터 시각화 등을 구현하는 데 사용됩니다."},
    {"tag": "svg", "description": "스케일러블 벡터 그래픽(SVG)을 정의하여, 벡터 기반의 그래픽을 HTML 문서 내에 직접 그릴 수 있습니다. 확대/축소해도 해상도가 유지되는 이미지를 생성하는 데 사용됩니다."},
    {"tag": "audio", "description": "오디오 콘텐츠를 재생하기 위한 요소입니다. `src` 속성을 사용하여 오디오 파일의 경로를 지정하며, 컨트롤러를 제공하여 재생을 관리할 수 있습니다."},
    {"tag": "video", "description": "비디오 콘텐츠를 재생하기 위한 요소입니다. `src` 속성으로 비디오 파일을 지정하며, 너비와 높이, 재생 컨트롤 등 다양한 속성을 설정할 수 있습니다."},
    {"tag": "form", "description": "사용자 입력을 수집하기 위한 HTML 폼을 생성합니다. 입력 필드, 체크박스, 라디오 버튼, 서밋 버튼 등을 포함할 수 있으며, 사용자 데이터를 서버로 전송하는 데 사용됩니다."},
    {"tag": "input", "description": "사용자로부터 데이터를 입력 받기 위한 입력 필드를 생성합니다. 텍스트, 비밀번호, 체크박스, 라디오 버튼 등 다양한 유형이 있습니다."},
    {"tag": "textarea", "description": "여러 줄의 텍스트를 입력할 수 있는 폼 필드를 생성합니다. 사용자가 댓글을 달거나 메시지를 작성할 때 주로 사용됩니다."},
    {"tag": "button", "description": "클릭할 수 있는 버튼을 정의합니다. 폼 제출, JavaScript 이벤트 트리거 등 다양한 동작을 수행하는 데 사용됩니다."},
    {"tag": "select", "description": "드롭다운 목록에서 사용자가 하나 이상의 옵션을 선택할 수 있게 하는 폼 요소입니다. 옵션 그룹을 구성하여 사용자에게 선택지를 제공합니다."}
  ]